andremgbr/Stm32FinalF1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

extern CAN_HandleTypeDef hcan;
extern UART_HandleTypeDef huart1;

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define hazard_light_Pin GPIO_PIN_1
#define hazard_light_GPIO_Port GPIOA
#define Hazard_lights_button_Pin GPIO_PIN_2
#define Hazard_lights_button_GPIO_Port GPIOA
#define Hazard_lights_button_EXTI_IRQn EXTI2_IRQn
#define REB_IPC_warning_Pin GPIO_PIN_4
#define REB_IPC_warning_GPIO_Port GPIOA
#define REB_deactivate_Pin GPIO_PIN_5
#define REB_deactivate_GPIO_Port GPIOA
#define REB_deactivate_EXTI_IRQn EXTI9_5_IRQn
#define Engine_REB_mode_Pin GPIO_PIN_6
#define Engine_REB_mode_GPIO_Port GPIOA
#define REB_IPC_fault_pin_Pin GPIO_PIN_7
#define REB_IPC_fault_pin_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
